In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
df = sns.load_dataset('planets')

In [5]:
df.head(3)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008
2  Radial Velocity       1         763.000  2.60     19.84  2011

In [9]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [11]:
df.info()  # dataset hakkında genel bilgi almak için

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [12]:
df.describe()  # numeric sütunların istatiksel bilgileri

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [14]:
df.shape  # satır ve sütun sayıları

(1035, 6)

In [15]:
df['orbital_period'].min()

0.09070629

In [16]:
df['orbital_period'].max()

730000.0

In [17]:
df['orbital_period'].argmin()

945

In [19]:
df['orbital_period'].idxmin()

945

In [23]:
df.describe().T  # satırlar ile sütunlar yer değiştirdi

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [25]:
df.isnull().sum()  # null dataların sayısı

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [26]:
df.dropna(how = "any")  # içinde herhangi bir tane NaN olan tüm satırı siler

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [27]:
df.dropna(how = "all")  # silmedi çünkü her sütunu boş olan bir satır yok

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [29]:
df.corr()  # -1 ile 1 arasında korelasyon değeri

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

In [30]:
df.corr()  # -1 ile 1 arası değişir. 0 olursa korelasyon yok. - lerde ise negatif + larda ise pozitif korelasyon vardır denilebilir.
# 1 ve -1 e yakın ise güçlü bir korelasyon vardır. Metamatikteki doğru ve ters orantı mantığı gibi düşünülebilir.

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

In [31]:
df[['mass', 'distance']].corr()

              mass  distance
mass      1.000000  0.274082
distance  0.274082  1.000000

In [33]:
df['method'].value_counts()  # unique değerlerin sayısını

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

### Groupby

In [38]:
df.groupby('method')[['orbital_period']].mean()  # dataframe

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [37]:
df.groupby('method')['orbital_period'].mean()  # series

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [39]:
df.groupby("method")[["orbital_period"]].mean()  # iki tane [[]] yapınca dataframe olarak getirir ve görselliği daha güzeldir.

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [40]:
df.groupby("method")[["orbital_period"]].describe()

                              orbital_period                                \
                                       count           mean            std
method
Astrometry                               2.0     631.180000     544.217663
Eclipse Timing Variations                9.0    4751.644444    2499.130945
Imaging                                 12.0  118247.737500  213978.177277
Microlensing                             7.0    3153.571429    1113.166333
Orbital Brightness Modulation            3.0       0.709307       0.725493
Pulsar Timing                            5.0    7343.021201   16313.265573
Pulsation Timing Variations              1.0    1170.000000            NaN
Radial Velocity                        553.0     823.354680    1454.926210
Transit                                397.0      21.102073      46.185893
Transit Timing Variations                3.0      79.783500      71.599884

                                                                       \
                                       min          25%           50%
method
Astrometry                      246.360000   438.770000    631.180000
Eclipse Timing Variations      1916.250000  2900.000000   4343.500000
Imaging                        4639.150000  8343.900000  27500.000000
Microlensing                   1825.000000  2375.000000   3300.000000
Orbital Brightness Modulation     0.240104     0.291496      0.342887
Pulsar Timing                     0.090706    25.262000     66.541900
Pulsation Timing Variations    1170.000000  1170.000000   1170.000000
Radial Velocity                   0.736540    38.021000    360.200000
Transit                           0.355000     3.160630      5.714932
Transit Timing Variations        22.339500    39.675250     57.011000


                                        75%            max
method
Astrometry                       823.590000    1016.000000
Eclipse Timing Variations       5767.000000   10220.000000
Imaging                        94250.000000  730000.000000
Microlensing                    3550.000000    5100.000000
Orbital Brightness Modulation      0.943908       1.544929
Pulsar Timing                     98.211400   36525.000000
Pulsation Timing Variations     1170.000000    1170.000000
Radial Velocity                  982.000000   17337.500000
Transit                           16.145700     331.600590
Transit Timing Variations        108.505500     160.000000

In [41]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [42]:
# unique eşi benzeri olmayan kendine has olan değişkenlerdir. Unique de bunların kendilerini getirir.
df.year.unique()  # year sütununda unique olan değerlerin ne olduğu gelir

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [43]:
df.year.nunique()  # bu da kaç tane unique değer olduğunu sayı olarak verir.

23

In [53]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [54]:
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [58]:
df1.groupby('Company')[['Sales']].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [60]:
df1.groupby('Company')[['Sales']].agg(['min','max'])

        Sales
          min  max
Company
FB        243  350
GOOG      120  200
MSFT      124  340

In [61]:
df1.groupby('Company')[['Sales']].agg(['min','max'])

        Sales                                                                  \
          min   max describe
        Sales Sales    count   mean         std    min     25%    50%     75%
Company
FB        243   350      2.0  296.5   75.660426  243.0  269.75  296.5  323.25
GOOG      120   200      2.0  160.0   56.568542  120.0  140.00  160.0  180.00
MSFT      124   340      2.0  232.0  152.735065  124.0  178.00  232.0  286.00



           max
Company
FB       350.0
GOOG     200.0
MSFT     340.0

In [66]:
df1.groupby('Company')[['Sales']].describe().T[['GOOG']]

Company            GOOG
Sales count    2.000000
      mean   160.000000
      std     56.568542
      min    120.000000
      25%    140.000000
      50%    160.000000
      75%    180.000000
      max    200.000000

In [67]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [68]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [69]:
df2.col2.unique()

array([444, 555, 666], dtype=int64)

In [70]:
df2.col2.nunique()

3

In [71]:
df2.col2.value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [73]:
df2[(df2.col1 > 2) & (df2.col2 ==444)]

   col1  col2 col3
3     4   444  xyz

In [74]:
df2['col2'].sum()  # sütun toplamını verdi.

2109

In [75]:
df2["col2"].sum()  # bu sütunun toplamı gelir. Neden axis belirtmedik, çünkü zaten sütunu indexledik

2109

In [ ]:
del df2['col2']  # silmeye yarar

In [78]:
df2.columns  # sütunların adını veriyor

Index(['col1', 'col2', 'col3'], dtype='object')

In [79]:
df2.index  # index bilgileri

RangeIndex(start=0, stop=4, step=1)

# Sorting

In [81]:
df2.sort_values(by = 'col2')  # col2 sütununa göre sırala

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [83]:
df2.sort_values(by = 'col3', ascending=False)

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

In [85]:
df2.sort_values(by = 'col3', ascending=True)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [86]:
df3 = pd.DataFrame({'col1':[1, 2, 3, np.nan],
                   'col2':[np.nan, 555, 666, 444],
                   'col3':['abc', 'def', 'ghi', 'xyz']})
df3.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [88]:
df3.dropna(how = 'any')  # herhangi bir yerinde NaN olan satırı sildi

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [89]:
df3.dropna()  # any herhangi bir sütununda none varsa komple satırı drop eder.
# all eğer tüm sütunlar none ise o satırı drop et
# thresh parametrsi ile de kaç tane none değer olduğunu koşullayıp ona göre drop ederiz

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [90]:
df3.fillna(value='Unknown')

      col1     col2 col3
0      1.0  Unknown  abc
1      2.0    555.0  def
2      3.0    666.0  ghi
3  Unknown    444.0  xyz

In [91]:
df3['col2'].fillna(df3.col2.mean())  # col2 nin ortalaması ile 
# col2 de yer alan değerlerin ortalaması ile doldurduk

0    555.0
1    555.0
2    666.0
3    444.0
Name: col2, dtype: float64

### Outlier cok ise median, degilse mean ile doldurulabilir.

### gercek projelerde default yaklasim olarak, categorik degiskenlerde Nan lari ''Others'' olarak doldurabilirsiniz.

In [94]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Map and Replace

In [97]:
my_map  = {'GOOG':'GOOGLE',
'MSFT': 'MIC', 'FB':'FACE'}

In [99]:
df1 = df1['Company'].map(my_map)

In [100]:
df1

0    GOOGLE
1    GOOGLE
2       MIC
3       MIC
4      FACE
5      FACE
Name: Company, dtype: object

In [125]:
df1 = pd.DataFrame(data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]})

In [102]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [107]:
df1['Sales'] = df1['Sales'].map(lambda x: x*1000)

In [108]:
df1

  Company   Person   Sales
0    GOOG      Sam  200000
1    GOOG  Charlie  120000
2    MSFT      Amy  340000
3    MSFT  Vanessa  124000
4      FB     Carl  243000
5      FB    Sarah  350000

In [109]:
df1['Company'].replace('GOOG','Google')

0    Google
1    Google
2      MSFT
3      MSFT
4        FB
5        FB
Name: Company, dtype: object

In [111]:
df1.Company = df1.Company.replace(to_replace='GOOG',value = 'Google')

In [112]:
df1

  Company   Person   Sales
0  Google      Sam  200000
1  Google  Charlie  120000
2    MSFT      Amy  340000
3    MSFT  Vanessa  124000
4      FB     Carl  243000
5      FB    Sarah  350000

In [134]:
df1.drop('Company',axis=1)

    Person  Sales
0      Sam    200
1  Charlie    120
2      Amy    340
3  Vanessa    124
4     Carl    243
5    Sarah    350

In [115]:
df1.Sales.astype(float)

0    200000.0
1    120000.0
2    340000.0
3    124000.0
4    243000.0
5    350000.0
Name: Sales, dtype: float64

In [120]:
df1.Sales= df1.Sales.astype(str)

In [121]:
df1.Sales.map(lambda x: x[:-3]+"k")

0    200k
1    120k
2    340k
3    124k
4    243k
5    350k
Name: Sales, dtype: object

In [122]:
def convert(k):
    return k[:-3]+"K"

In [132]:
def convert(k):
    return k[:-3]+"K"
df1.Sales.astype(str).apply(convert)

0    K
1    K
2    K
3    K
4    K
5    K
Name: Sales, dtype: object

In [133]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [136]:
df4.groupby('groups').mean().T

groups    A    B    C
var1     16   17   66
var2    181  182  651

In [138]:
df4.groupby('groups').agg(['min','max'])

groups      A    B    C
var1 min   10   11   33
     max   22   23   99
var2 min  100  111  333
     max  262  253  969

In [139]:
df4.groupby('groups').agg({'var1':"min", 'var2':'max'})

        var1  var2
groups
A         10   262
B         11   253
C         33   969

In [140]:
df4.groupby('groups').agg({'var1':"min", 'var2':'max'}).T

groups    A    B    C
var1     10   11   33
var2    262  253  969

### Apply

In [142]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [144]:
df4.apply('sum')

groups    ABCABC
var1         198
var2        2028
dtype: object

In [145]:
df4.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [146]:
def mul_2(x):
    return x*2

In [147]:
df4.var1.apply(mul_2)

0     20
1     46
2     66
3     44
4     22
5    198
Name: var1, dtype: int64

In [151]:
titanic = sns.load_dataset('titanic')

In [152]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [154]:
titanic.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [162]:
titanic.groupby(['sex','class']).survived.size()

sex     class
female  First      94
        Second     76
        Third     144
male    First     122
        Second    108
        Third     347
Name: survived, dtype: int64